Repository: jweiland-net/infinitescrolling
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: da, de

# constants.includeJQueryLibrary
source: Include jQuery: Enable this option to include jquery
da: Inkludér jQuery: Aktivér denne indstilling for at inkludere jquery
de: jQuery einbinden: Aktivieren, um jQuery einzubinden

# constants.scrollContainer
source: jQuery selector for Scroll Container: In which container the scrollbar is placed? Sample: jQuery(window)
da: jQuery selector til Scroll Container: Den container hvor scrollbar er placeret? Eksempel: jQuery(window)
de: jQuery Bezeichner für den Container mit Scrollbar: Trage hier den jQuery Bezeichner für den Container ein, der die Scrollleiste beinhaltet. Zum Beispiel: jQuery(window)

# constants.container
source: jQuery selector for item container: Enter the selector which selects the container which contains all f.e. news or event items you want to paginate. Sample: div.news-list-container
da: jQuery selector til element container: Indtast selector som vælger den container som indeholder for eksempel alle nyheder eller begivenhedselementer du vil paginere. Eksempel: div.news-list-container
de: jQuery Bezeichner für den Container aller Einträge: Trage hier den jQuery Bezeichner für den Container ein, der alle Einträge für z.B. Neuigkeiten oder Veranstaltungen enthält. Zum Beispiel: div.news-list-container

# constants.item
source: jQuery selector for one single item: Enter the selector which contains exactly one single item within the list container. Sample: div.news-list-item
da: jQuery selector til et enkelt element: Indtast selector som indeholder præcis et enkelt element i listecontaineren. Eksempel: div.news-list-item
de: jQuery Bezeichner für einen einzigen Eintrag: Trage hier den jQuery Bezeichner für einen einzelnen Eintrag innerhalb des Listencontainer ein: Zum Beispiel: div.news-list-item

# constants.pagination
source: jQuery selector for Paginator: Enter the selector for the paginator. This selector will hide paginator in Frontend. Sample: div.news-list-browse
da: jQuery selector til Paginator: Indtast selectoren for paginatoren. Denne selector vil skjule paginator i frontend. Eksempel: div.news-list-browse
de: jQuery Bezeichner für den Navigator: Trage hier den jQuery Bezeichner für die Seitennavigation (Vorherige, Seite1, Seite2, Nächste) ein. Zum Beispiel: div.news-list-browse

# constants.next
source: jQuery selector for next link: Enter the selector for the next link within the paginator. InfiniteScrolling will read the href attribute to read the container of next page and append it to current container. Sample: div.browseLinksWrap a:eq(-2)
da: jQuery selector til næste link: Indtast selector til det næste link i paginatoren. InfiniteScrolling vil læse href-attributten for at læse containeren til næste side og tilføje den til den aktuelle container. Eksempel: div.browseLinksWrap a:eq(-2)
de: jQuery Bezeichner für den Link zur nächsten Seite: Trage hier den jQuery Bezeichner für den nächste Seite ein. InfiniteScrolling liest dann den enthaltenen href aus und läd im Hintergrund von dieser Seite den oben angegebenen Container aus und fügt diesen dann dem Container der aktuellen Seite an. Zum Beispiel: li.next a

# constants.previous
source: jQuery selector for previous link: Enter the selector for the previous link of the paginator. The href attribute of this element will be used to get the items from the previous page. Make sure there is only one element that matches the selector.
da: jQuery selector til forrige link: Indtast selector til det forrige link til paginatoren. Attributten href til dette element vil blive brugt til at hente elementerne fra forrige side. Sørg for, at der kun er ét element, der matcher selctoren.
de: jQuery Bezeichner für den Link zur vorherigen Seite: Trage hier den jQuery Bezeichner für die vorherige Seite ein. InfiniteScrolling liest dann den enthaltenen href aus und läd im Hintergrund von dieser Seite den oben angegebenen Container aus und fügt diesen dann dem Container der aktuellen Seite voran. Zum Beispiel: li.previous a

# constants.loader.html
source: Change HTML of loader icon: Enter your own HTML, if you want another rendering of the loader icon. Use {src} to implement the original loader icon from infinitescrolling JS.
da: Skift HTML af loader ikon: Indtast din egen HTML, hvis du ønsker en anden rendering af loader ikonet. Brug {src} til at implementere det originale loader-ikon fra infinitescrolling JS.
de: HTML für das Icon des Ladestatus ändern: Trage Dein eigenes HTML für das Aussehen des Ladestatus ein. Verwende {src}, um das mitgelieferte Ladeicon zu verwenden.

# constants.delay
source: Define a delay until further items will be loaded: If you want the user to see the loader icon working you should set this value to something higher than 0. Value in milliseconds.
da: Definér en forsinkelse indtil yderligere elementer vil blive indlæst: Hvis du vil have brugeren til at se at loader-ikonet virker, skal du sætte denne værdi til noget højere end 0. Værdien er angivet i millisekunder.
de: Verzögerung in Millisekunden bevor weitere Einträge nachgeladen werden: Nur wenn eine Verzögerung gesetzt ist, kann der Benutzer das Ladeicon sehen.

# constants.offset
source: Amount of loads: How often more items should be loaded, before we show a link to manually load further items? Don't set it too high as footer may not be reachable then.
da: Belastning: Hvor ofte skal flere elementer indlæses, før vi viser et link for manuelt at indlæse yderligere elementer? Sæt ikke værdien for højt, da footer måske ikke kan nå at blive indlæst.
de: Anzahl der Nachladevorgänge: Wie oft sollen Einträge nachgeladen werden bevor ein Link erscheint, um manuell weitere Einträge nachzuladen? Setze den Wert nicht zu hoch, da der Footer Deiner Seite nicht mehr erreicht werden kann.

# constants.negativeMargin
source: Start next request when margin (ps) has been reached: Define a margin from the lowest border of the last item. If scrollbar reaches this margin the new request will be started. As higher the value as earlier the page will start loading further items.
da: Start næste forespørgsel når margin (ps) er nået: Definér en margin fra den laveste kant af det sidste element. Hvis rullebjælken når denne margin, vil den nye forespørgsel blive startet. Jo højere værdi, jo tidligere vil siden begynde at indlæse yderligere elementer.
de: Starte nächsten Request bei Erreichen des Abstandes (px): Gebe hier einen Abstand (margin) in Pixel von dem untersten Rand des letzten Eintrages an, um ein Nachladen zu initiieren, wenn der Scrollbalken diesen Wert erreicht hat. Je höher der Wert, desto früher werden weitere Einträge nachgeladen.

source: Load more items
da: Indlæs flere elementer
de: Weitere Einträge laden

# loadPrevItems
source: Load previous items
da: Indlæs tidligere elementer
de: Vorherige Einträge laden
